[
    {
        "company": "ADP",
        "company_location": "Hyderabad, India (Hybrid)",
        "role": "Member Technical",
        "team": "ADP DataCloud",
        "time_duration": "Dec 2021 - Present",
        "details": [
        	{
                "title": "ADP Analytics Assistant",
                "description": "Built MVP of chat based Analytics Application by leveraging Generative AI. ",
                "languages":"Java, Spring Boot, AWS, Postgresql, Redis, Kubernates, Helm"
            },
        	{
                "title": "Analytics - MyADP Integration as MFE",
                "description": "Engineered a seamless integration solution by centralizing all Analytics APIs to route through MyADP, ensuring compliance with stringent internal security standards.",
                "languages": "YAML, Python"
            },
            {
                "title": "Client Onboarding \\& Billing Automation",
                "description": "Implemented client auto onboarding and billing automation strategies, resulting in a significant reduction in manual work, API hits and enhancing the overall billing experience for clients. Carefully considered business use cases to deliver a seamless billing process.",
                "languages": "YAML, Python"
            },
            {
                "title": "Analytics Experience",
                "description": "Design and develop optimal solutions using Java to meet project requirements and performance goals. Built MVP of Analytics Assistant by leveraging GenAI. Creating and optimising API's for seamless integration to front end applications. Collaborate with cross-functional teams to gather requirements and analyze technical feasibility to resolve complex business logic challenges. Optimized the performance of a feature which is majorly used in all ADP products. ",
                "languages": "Java, Spring Boot, Micronaut, AWS, MySQL, Postgresql, MyBatis, Redis, Kafka"
            }
        ],
        "points": [
            {
                "description": "\\textbf{Projects:} ADP Analytics Assist(GenAI), MyADP-Analytics Integration as MFE, Policy Engine, Auto Onboarding"
            },
            {
                "description": "Design and develop microservices using Java and Spring Boot, ensuring high scalability and performance."
            },
        	{
                "description": "Collaborated with frontend developers and Product Managers to deploy RESTful APIs, ensuring smooth communication."
            },
            {
                "description": "Enhanced Client Billing Experience by optimising algorithm to boost efficiency and reduce API load."
            },
            {
                "description": "Implemented caching strategies and utilised asynchronous or parallel processing to enhance application performance."
            },
            {
                "description": "Integrated third-party APIs and services for additional functionalities, such as Recommender Systems and OpenAI/LLM."
            },
        	{
                "description": "Engineered a seamless integration solution by centralizing all DataCloud APIs to route through MyADP, ensuring compliance with stringent internal security standards."
            },
        	{
                "description": "Investigated and resolved complex technical issues, utilising debugging tools and techniques to identify root causes and implement effective solutions."
            },
            {
                "description": "Utilized Docker, Kubernetes and Helm Charts for containerization, orchestration and configuration management of microservices and automated the deployment process with CI/CD pipelines."
            },
            {
                "description": "Participated in code reviews and written Unit Test cases to ensure code quality and maintainability."
            }
        ]
    },
    {
        "company": "Mindtree",
        "company_location": "Hyderabad, India (Remote)",
        "role": "Software Engineer Trainee",
        "team": "SDET Java",
        "time_duration": "Aug 2021 - Dec 2021",
        "details": [
            {
                "title": "Training",
                "description": "Got trained on Java Selenium Framework. Learnt core concepts of Java, MySQL, GIT, MongoDB. Developed basic Web Application and written Test Suite for app. ",
                "languages": "Java, MySQL, GIT, MongoDB"
            }
        ],
        "points": [
            {
                "description": "Got trained on Java Selenium Framework. Learnt core concepts of Java, MySQL, GIT, MongoDB."
            },
        	{
                "description": "Developed basic Web Application and written and executed test suite for it."
            }
        ]
    },
    {
        "company": "IIIT Hyderabad",
        "company_location": "Hyderabad, India (Remote)",
        "role": "Summer Internship",
        "team": "NLP",
        "time_duration": "May 2021 - July 2021",
        "details": [
            {
                "title": "Headline Generation for Telugu News Articles",
                "description": "Led Headline Generation project for Telugu news articles utilizing Natural Language Processing techniques. Played a pivotal role in the creation of training data for Telugu news articles, enhancing the dataset's quality by crafting comprehensive summaries.",
                "languages": "Python, NLP, Google Colab"
            }
        ],
        "points": [
            {
                "description": "Led Headline Generation project for Telugu news articles utilizing Natural Language Processing techniques."
            },
        	{
                "description": "Played a pivotal role in the creation of training data for Telugu news articles, enhancing the dataset's quality by crafting comprehensive summaries."
            }
        ]
    }
]
